["- Димон, народу ты полюбился, и я решил оставить тебя на второй срок.\n- Правда? Ой, спасибо, Владимир Владимирович.\n- Шучу, дурак. С Первым апреля тебя!","Минский метрополитен тоже готовит свои шутки к 1 апреля. \n- Теперь перила и ступеньки будут ездить в разные стороны.","Мужик с другом сидят в баре, бухают. Друг: - А давай позвоню твоей жене, пошутим, 1 апреля всё же!\nМужик: - Ну давай! А потом я твоей!\nДруг звонит с его телефона. Жена: - Я же тебе сказала не звонить, я на совещании! Занята!\nДруг: - Извините, но ваш муж только что попал под машину.\nЖена: - Насмерть?\nДруг: - Да нет, жив. В больницу увезли.\nЧерез 5 минут мужик берёт телефон у друга и звонит уже его жене. Она с ходу:\n- Ой, привет, дорогой! У меня новость-то какая! У Светки мужик-то допился, машина сбила! Она с любовником прямо из ресторана к себе домой помчалась отмечать.","Блондинка в начале апреля:\n- Я теперь больше сплю.\n- Это как?\n- Я раньше ложилась в 2 ночи. Теперь я тоже ложусь в 2 ночи, но по старому-то это 1 час ночи!","Мужик с другом сидят в баре, бухают. Друг: - А давай позвоню твоей жене, пошутим, 1 апреля всё же!\nМужик: - Ну давай! А потом я твоей!\nДруг звонит с его телефона. Жена: - Я же тебе сказала не звонить, я на совещании! Занята!\nДруг: - Извините, но ваш муж только что попал под машину.\nЖена: - Насмерть?\nДруг: - Да нет, жив. В больницу увезли.\nЧерез 5 минут мужик берёт телефон у друга и звонит уже его жене. Она с ходу:\n- Ой, привет, дорогой! У меня новость-то какая! У Светки мужик-то допился, машина сбила! Она с любовником прямо из ресторана к себе домой помчалась отмечать.","1-е апреля. Мужик приходит домой счастливый, просто сияет. Ему жена:\n- Что случилось?\n- Да представляешь, я щас так таксиста обманул!!! Я ему деньги дал, а сам не поехал!!","- 1-го апреля у Януковича в отличие большинства украинцев был рабочий день.\n- Это почему?\n- А он весь день врал и разыгрывал народ, то есть занимался своим обычным делом.","1 апреля.\n- Сударыня, у вас вся спина белая.\n- У меня все тело такое...","Самые остроумные люди на Земле - лифтеры. \n- Понимание этого приходит тогда, когда 1 апреля, закупив провизии на неделю, по возвращении из магазина поднимаешься с сумками на восьмой этаж пешком.","Еще одна поправка к правилам дорожного движения, которую пока от нас скрывают: к 1 апреля на желтых жилетках сотрудников ГИБДД должна быть указана стоимость их услуг. Как сейчас это сделано у работников  муниципальных парковок.","Объявление в одесском суде 1 апреля: \n- Все решения, постановления и определения суда принятые сегодня, могут быть отменены в порядке апелляции в любом другом суде по любым, даже самым смешным основаниям.","Маленький мальчик подбегает к маме и говорит:\n- Мама, мама! Там папа повесился!\nИспуганная мать:\n- Где? где?\n- Там, на чердаке!\nПрибегают они на чердак а там - никого!\n- Ну и где же папа?\n- АА!! Первое апреля никому не верю! Он в подвале повесился!","- Первое апреля уже давно позади, а народ все продолжает шутить...\n- Мне вон сегодня сообщили, что Христос воскрес.","Жена избила собственного мужа. Подсудимую просят рассказать, как было дело.\n- Сначала он вызвал меня с работы домой, затем раздел и уложил в постель, а потом с идиотским смехом заявил, что сегодня 1 апреля!","- Дорогой, я беременна. \n- Что-о-о-о-о?! \n- С 1 апреля тебя, любимый! \n- Люся, ты чё, ну так же до инфаркта довести можно. \n- Как ты меня назвал?! Какая я тебе Люся?! \n- С 1 апреля тебя, любимая!","- Слыхали, Порошенко объявил, что на Украине жизнь налаживается. \n- Знаем, знаем – скоро 1 апреля.","1 апреля в аптеках тесты на беременность продавались сразу с двумя полосками.","1 апреля – день зачатия нового года. Осталось девять месяцев до 1 января.","1 апреля. Муж возвращается домой. А там его жена с его лучшим другом тр@х@ется. Мужик, разводя руками:\n- Очень смешно, бл*дь!!!","23 февраля - мужской праздник, 8 марта - женский, а 1 апреля - День дураков - всеобщий!","- Дорогой, я беременна.\n- Что-о-о-о-о-о?\n- С 1 апреля тебя, любимый!\n- Кать, ты чё, ну так же до инфаркта довести можно.\n- Как ты меня назвал? Какая я тебе Катя?!\n- С 1 апреля тебя, любимая!","- У меня день рождения первого апреля. Но я его никогда не отмечаю.\n- Почему?...\n- Мне никто не верит.","1 апреля самый хороший день - можешь говорить правду людям и знать, что они на тебя не обидятся, потому что все будут думать что ты пошутил.","1 апреля меня бросила баба - три дня трубку не брала, сегодня звонит и говорит я пошутила. А я уже новую нашел, пипец как-то не ловко.","Дорогие петербуржцы! 1 апреля в честь Дня смеха мосты будут разводиться в любое время и без предупреждения.","Жена спрашивает мужа:\n- Дорогой! Что ты мне собираешься подарить на 8 марта?\n- Да пока еще не решил, дорогая, - отвечает муж. - Вот цветы уже купил.\nЖена:\n- А знаешь, мне так нравится цифра 8, что если ты за ночь сделаешь мне 8 раз приятно, то я буду очень счастлива!\nМуж в задумчивости:\n- Вот что, бери пока цветы, а все остальное мы перенесем на 1 апреля...\nЖена:\n- Ну уж нет, если переносить, то на 9 мая!","1-го января родились те, у кого родители хорошо пошутили 1 апреля?","Хорошо тем, у кого была свадьба 1 апреля. При разводе можно будет сказать, что это была всего лишь невинная шутка.","- Как прошло 1 апреля на работе?\n- Весело. Директор издал приказ о сокращении всего нашего отдела - мы так смеялись. А сегодня оказалось, что это правда - директор так смеялся.","Странно, а почему в стране дураков день дурака отмечается только 1 апреля!?","- Слышала, первое апреля будет в пятницу.\n- Да? Только бы это не было бы пятница, тринадцатое.","Сегодня, 1-го апреля, во всем мире отмечается День дурака. Не забудьте поздравить своих бывших с праздником.","Если 1 апреля не пошутишь, чувствуешь себя последним дураком. А пошутишь - чувствуешь первым."]