["Правильный военник!","Так как в армию во время очередной мобилизации призовут и женщин, военкомы с пачками повесток отправились на Окружную…","Осенняя пора, очей очарованье.\nПовесточкой шуршит подвявшая листва.\nИ быстрое от службы убегание\nПотянет минимум на года два.","Военком призывнику:\n— То, что у вас врожденное плоскостопие, меня не убедило. Некоторые, чтобы не служить в армии, вообще специально рождаются девочками!","В Украине восьмая тотальная мобилизация - и ни звука.\nО частичной мобилизации в России бурлит весь мир.\nДискриминация, однако.","Заманчивое предложение⁠⁠","Вопрос : Когда можно будет увидеть Максима Галкина отмобилизованого на Донбасс?","Стих о частичной (ограниченной) мобилизации\n\nС мобилизацией станет понятно,\nЕсли прочтешь сей несложный стих.\nОграничения - для депутатов,\nМобилизация - для остальных!","Летят на «Ладе» как в карете,\nНа свежие могилы сыновей,\nИ с завистью глядят на них соседи,\nРодившие когда-то дочерей....\n\nАлина Райз","Крик из военкомата: \"Свободная каска!\"","Двое в постели.\n- Дорогой, а что-то он у тебя совсем не твёрдый ...\n- Ну-у-у, он просто частично мобилизован. И так сойдёт.","Дети депутатов, министров, губернаторов, руководителей Газпрома и Роснефти априори не подлежат мобилизации, т.к. они не служили в Российской армии. Это всё, что я понял из указа Президента.","Если на стекле вашей машины буква Z - военкомат ждёт вас с распростёртыми объятиями.","- А что, отец, загранпаспорт у вас можно оформить?\n- Кому и военный билет - загранпаспорт...","— Папа, а почему нас везут на фронт?\n— Не знаю, сынок, я политикой не интересуюсь.","Если я правильно понял, теперь за отказ идти убивать дают такой же срок как за убийство?","Тот неловкий момент, когда мобилизация не коснётся иноагентов...","","Достали эти рекламщики! Звонили насчет мобилизации населения. Я им сказал, что у меня уже есть 3 мобильника, а больше мне и на х*й не надо.","- Род занятий матери?\n- Педагог.\n- Род занятий отца?\n- Пианист.\n- В танковые войска не годен!","Призывников с нетрадиционной сексуальной ориентацией в военкомате называют — негодниками.","Частичная мобилизация. Часть первая.","- Пришло время отдать свой долг Родине.\n- А если я его не брал?\n- Отдавать все равно придется.","Помнится, некоторые очень любили присказку: «Не нравится – вали из страны!» \nПохоже, настало время сказать им: «Нравится? Вали в окопы!»","Вслед за самоизоляцией приходит самомобилизация!","Акция для девушек: приведите в военкомат свою тряпку, и получите через 12 месяцев настоящего мужика.","От мобилизации на войну Буратино открутился с помощью самореза.","Хочешь мира - готовься к мобилизации.","Медкомиссия у призывников. Один симулирует, что он слепой. Медсестра показывает буквы:\n— Видишь буквы?\n— Не вижу…\nМедсестра разделась догола.\n— Меня видишь?\n— Не вижу…\nМедсестра оттягивает штаны, смотрит: стоит у него.\n— А почему стоит?\n— Не знаю. У меня своя голова, у него — своя.","Есть закон о забвении в интернете, плохо что нет закона о забвении в военкомате.","И тут все как ломанулись своих не бросать.","Первая волна мобилизации - ЗАПАСНИКИ!\nЧетвертая, те у кого есть одежда цвета хаки...","Когда-нибудь, ко мне подойдёт мой внук и спросит:\n\"Дедушка! Интересно было жить в историческое время?\"\nЯ рассмеюсь и отвечу:\n\"Нет, я думал, что мы все умрем.\"","Это должно было закончится в XX веке, но одна страна вдруг сказала «можем повторить».","Масочку сняли, касочку надели!","В детстве папа говорил мне, чтобы я не открывал незнакомым дядям дверь, а сейчас я ему это говорю.","В начале августа - \"Сколько стоит собрать ребёнка в школу?\"\nВ конце сентября - \"Сколько стоит собрать мужика на фронт?\"","- Вы служили в армии?\n- Нет.\n- Поздравляем, у вас появился отличный шанс!","- Объявлена массовая дебилизация.\n- Может мобилизация?\n- НЕТ.","А вот эти хитрецы на условке, хорошо устроились...","Два года назад самый важный человек в городе был - санитарный врач.\nС сегодняшнего дня самый важный человек в городе - военком.\nПримерно так работают социальные лифты...","В наши дни ничто так не мобилизует народ, как курорты Турции.","","","Пацаны, мы скучно живем!\nПерестали прятаться в подвалах у любимых женщин!","В связи с последними событиями, и информации что отсрочку дают тем, у кого на иждивении 4 и более детей до 16...\nДумаю пора написать всем бывшим и сделать тесты на Отцовство!","Министерство обороны объявило об открытии военкоматов в Лондоне, Берлине и других столицах для мобилизации лучших из россиян.","Мобилизация это импортозамещение профессиональной армии.","Четвёртую дочку в семье папа назвал Отсрочкой.","А прикиньте, что сейчас чувствуют люди, которые когда-то решили: \"Пойду, отслужу годик, чтоб отстали!\"","В первую волну мобилизируют видеоблогеров и тиктокеров!\nПоследних, сразу отправят на передок, в самые горячие точки.","Явка студентов на занятия 22 сентября составила 120%","Фраза \"да кому ты нужна с четырьмя детьми\" заиграла новыми красками...","Мобилизация, конечно, хорошо!\nДавайте также тех мобилизуем,\nКто место себе хлебное нашёл,\nСтране вредит, по делу в ус не дуя.\n\nКто насекомых заставляет есть,\nГлобальную повестку продвигая,\nКто впопыхах забывши слово «честь»,\nБюджет страны кабальный принимает.\n\nГде выход наш из ВОЗ и ВТО,\nКоторые повисли кандалами?\nМы нефть и газ и тьму еще чего\nКогда отрубим тем, кто стал врагами?\n\nГде олигарх с поддержкою рублем\nДля фронта, не на праздные беседы?\nГде шоу-бизнес с песнями о том,\nКак стоек наш солдат, верша Победу?\n\nДаешь мобилизацию в умах,\nЧтоб полною была, а не частичной.\nС врагами надо биться на ножах,\nА не ресурсом греть, гребя наличность.\n\nНарод готов и воевать, и пасть\nЗа дом свой, за семью, страну и веру\nНо не за тех, кто получивши власть,\nЕго же истребляют планомерно.\n\nТак чистьте от вредителей ряды,\nЧтобы народ в итоге в власть поверил.\nИначе недалече до беды,\nКогда нацизм снесет ударом двери.\n\nНа фронте ж просто слово не в цене,\nА нужен ствол и штык не иллюзорный\nВсех, кто на митинг вышел «нет войне»,\nТуда отправить вовсе не зазорно.\n\nОлег Родионов","Уже не так смешно","Идет лиса по лесу, а навстречу ей лысый ежик. \nЛиса:\n- Ты что, под мобилизацию попал?\n- Нет, под газонокосилку.","Заметил, что в последнее время всё сложнее понять, какие именно, блять, события имеются ввиду под словами \"в связи с текущими событиями\".","Звонок из военкомата:\n– Вы где?\n– В Караганде.","Как показали последние события - предпоследние были лучше...","— Изя, а что такое частичная мобилизация?\n— Это значит, Сёма, что мобилизуют всех, кто не сможет откупиться или не успеет сбежать.","Повторяем, мобилизация будет именно частичной!\nТе, кто \"вне политики\" и \"в политике не разбирается\" не подлежат мобилизации...","Вообще с нашим новоязом, когда взрыв называют хлопком, падение - отрицательным ростом, наводнение - подтоплением и т.д., странно, что мобилизацию не назвали раздачей бесплатных загранпутевок...","А что сразу я?","Самое популярное туристическое направление 2022: Казахстан. \nРоссияне так рады за казахов, которые переименовали столицу, что захотели лично посмотреть обновленный город.","Пробуждение диванных войск!","Что значит не хотите в армию?\nА кто подарки на 23-е получал?","Медведя вызвали в военкомат. Идет туда грустный — не хочется в армию. На встречу ему бежит Заяц. Спрашивает:\n— Что ты такой, Миша, грустный?\n— В военкомат вызвали, а мне неохота в армию идти.\n— Давай мы тебе дубиной все зубы выбьем, тебя и не возьмут?\nТак и сделали.Через несколько дней встречает Заяц Медведя:\n— Ну что, Миша, взяли в армию?\nМедведь довольный:\n— Не! Плофкофтопие!","Никогда не думал что после 30-ти на вопрос служил ли я, буду отвечать ещё нет.","Ну что? Диванные войска превращаются в настоящие?","Буква Z на аватаре, футболке и автомобиле означает ваше согласие быть мобилизованным в первую очередь.","Я реально поймал себя на мысли, что скучаю по тихому 2020 году...","Первые 10 человек, которым военкоматы не смогли вручить повестки после объявления очередной мобилизации, объявлены Украиной в международный розыск.","Во время чеченской войны генерал Лебедь говорил: \"Дайте мне набрать роту из детей элиты и война через день закончится.","В первую очередь призывать будут блогеров и граждан которые в комментариях давали советы Министерству обороны России.\nПросто спецы нужны!","Разработчики World of Tanks слили в военкоматы персональные данные самых лучших игроков.","Пришла в наш дом повестка,\nЛежу и слышу как жена\nСо всей семьёю делит шкуру\nВ бою убитого меня.\nЖена и тёща подгоняют -\nИди скорей в военкомат!\nРюкзак мне старый собирают,\nБуханку, кружку, доширак.\nНе вздумай сдуру в плен сдаваться!\nИ без вести не пропади!\nЧтоб труп оформили как надо!\nЧтоб гробовые нам пришли!\nНу шутка ли, семь миллионов!\nМы купим всё что захотим!\nКредиты наши все закроем!\nА летом все поедем в Крым!\nЖена кричит: куплю машину!\nСынишка хочет самокат,\nА тестю - новую теплицу\nИ самогонный аппарат.\nИ тесть кричит - ты будь героем!\nВ атаку первым там иди!\nИ тут я наконец-то понял,\nКак много значу для семьи.\n\nАлина Райз","Частичная мобилизация - это типа идут все, кроме депутатов, правильно понимаю?","В лесу мобилизация. Волку ужасно не хочется на передовую. Но однажды ему приходит повестка в военкомат. Делать нечего — идет Волк в военкомат, а на встречу ему Заяц, веселый такой.\nВолк спрашивает:\n— Ты чего такой веселый, Заяц?\nЗаяц говорит:\n— Да вот, в военкомате был — в стройбат взяли.\nВолк:\n— А как тебе удалось в стройбат попасть?\nЗаяц отвечает:\n— Я пришел, мне стали показывать разные пистолеты там, гранаты, пулеметы и спрашивать \"Что это такое?\" Я стал говорить, что не знаю. В конце концов они достали из сейфа кирпич и тоже его мне показали. Я сказал, что это кирпич и меня взяли в стройбат.\nВолк воодушевился и более твердой походкой направился в военкомат. В военкомате ему показали пистолет и спросили:\n— Что это?\nВолк:\n— Не знаю!\nПоказали патрон. Волк опять:\n— Не знаю!\nПоказывают пулемет, гранату, динамит… Волку надоело, он говорит:\n— Зато я знаю, что у вас в сейфе кирпич лежит.\n— А ты откуда знаешь? — спрашивают.\nВолк:\n— Откуда надо, оттуда и знаю.\n— Молодец — в разведку пойдешь!","В России мобилизовать будут только тех, кто служил в армии.\nТак хитрый Шойгу себя обезопасил.","Беременная четверней девушка, сроком больше 22 недель, ищет отца своих детей.\n\nДорого!","Интересный факт! Если пришедшему к вам с повесткой военкому, дать пиздюлей и забрать его кошелек - то срок вам дадут меньше, чем за уклонение от мобилизации.","","А разве первыми в военкомат вызывают не тех, у кого на машине наклеено: \"Можем повторить!\"?","Если бы на стройке сказали, что из привезенных на объект запланированных 150 тысяч кирпичей было разбито 6 тысяч и поэтому нам надо срочно докупить 300 тысяч - я бы удивился. \nА если бы на ухо шепнули, что на самом деле - миллион, вообще бы офигел!","Где можно прочитать про коронавирус?\nХочется расслабиться, после новостей о мобилизации...","- Господин Шойгу, а почему в мобилизационных списках нет детей членов правительства и депутатов ГосДумы?\n- Вы что указ не читали? Мобилизация касается только граждан Российской Федерации.","После обещания Путина не забирать студентов по ограниченной мобилизации количество прогульщиков резко сократилось...","- Куда делись все эти чудесные люди с буквой Z на футболках и аватарках, как дело к мобилизации пошло?\n- Zассали.","Без лишних слов...","Летопись:\n2020 - Самоизоляция\n2021 - Вакцинация\n2022 - Мобилизация\n2023 - ...?","Москва слезам не верит.\n- А что вообще в мире делается?\n- Знаешь, Гоша... Ты лучше продолжай бухать!"]