["Умирает 30-летний программист. Вот стоит он перед вратами рая, около них стоит святой Петр и читает книгу жизни.\nПрограммист:\n- Боже, за что ты меня забрал, я же такой молодой, еще только 30 лет, жить да жить.\nСвятой Петр, не отрываясь от книги:\n- Не знаю, не знаю, по тайм-репортам тебе уже 96 лет.","Машинный зал РИСИ. За пишмашкой (это такие сильно озвученные дисплеи были на ЕСках) сидит системщик Костя Тальнишних. Шеф водит экскурсию по машзалу и с очень солидным видом поясняет:\n- Это системный ввод...\n- Это системный вывод...\n- Это системный процессор...\n- Это системная консоль...\n- Это системный программист...","В неделе есть пять плохих дней, когда не работают программы и два хороших, когда не работают программисты.","Лежит программист в постели с девушкой, водит по ней пальцем и приговаривает:\n- Что-то я не пойму, где здесь вход на сайт, а где просто баннеры?","Программист на приёме у глазного врача\n- Прочтите эту строку таблицы (показывает \"КНШМЫБИ\")\n- Доктор, у Вас неправильно настроена кодировка!","Идут дети по зоопарку. Им учительница и говорит:\n- Вот дети, слон!\nДети:\n- СЛОН!\n- Вот дети медведь!\nДети:\n- МЕДВЕДЬ! А вон программист сидит.\n- Да вы что, дети, это же обезьяна!!!!!!!\n- Как так обезьяна - не стрижен, не мыт и мозоль на заднице. Значит программист.","Вызывает ЕБН программиста и спрашивает:\n- Что за проблема 2000?\nПрограммист объясняет. ЕБН про себя: \n- Нет, лучше пойду воставку.","Вопрос армянскому радио:\n- Почему у программистов в 80% случаев рождаются девочки?\n- Потому что их развелось в пять раз больше, чем надо!","Женщина-программист как морская свинка: \n- Ни к свиньям, ни к морю никакого отношения не имеет.","Профессиональная этика. В молодых профессиях, как программисты, - она в процессе становления. А в древнейших, как, например проституция, - этика перешла в поэтику.","Разговаривают два российских программиста. Один из бюджетной организации, другой из коммерческой. Тот, который из коммерческой, спрашивает:\n— У тебя какая зарплата?\n— Двести баксов.\n— Нормально. А сколько ты отдаёшь жене?\n— Сто пятьдесят.\n— Ну, ты и жадный! Я вот по ведомости получаю сто баксов, и то отдаю жене в 10 раз больше!","В трамвае:\n- Девушка! А девушка! А вы наверно программиста?\n- Да, но как вы догадались?!!\n- У вас очень глупое лицо!\n- ДУРАК!!!\n- Да, я тоже программист...","Девушка в постели с программистом:\n— Перегрузиться не пробовал?","Чем отличается программист от Казановы?\n- Казанова налаживает любовные связи, а программист еще и гипертекстовые.","Программист сидит за компьютером, целиком поглощенный работой. Тут ему жена говорит: \n- Что-то я своего лифчика не нахожу, ты не знаешь, где он? Муж, не отрываясь от экрана монитора: \n- Не знаю - поищи на Яндексе.","Посылают программиста в магазин:\n- Купи пять бутылок пива, и если будет чехонь, то купи десяток.\nЧерез полчаса программист возвращается с пятнадцатью бутылками пива.\n- Что это?! Зачем ты купил столько пива?\nПрограммист:\n- Hу так чехонь-то была...","Судят программиста. Судья объявляет срок наказания. На что обвиняемый заявляет:\n- А где скидка для фидошника!","- Что самое главное для программиста, собирающегося провести ночь с подругой?\n- Чтобы система не повисла.\n- А если все-таки повиснет?\n- Ну тогда как всегда, тремя пальцами.","У жены программиста спросили:\n- А как он за тобой ухаживал?\nЖена, после минутного раздумья:\n- Компьютер показал...","Ранее утро. Аэропорт. Сонный программист. Ждет самолета на Москву. Входной антитеррористический контроль. Дама на рентген-установке, тыкая пальчиком в черный прямоугольник на экране:\n- А что это у вас?\n- Винчестер...\n- ?!?!","Первый признак того, что программист тормозит - это когда включает комп, и кажется, что тот работает быстрее.","- Ложась спать программист ставит рядом на столик 2 стакана.\n- Один с водой — если захочет пить, второй пустой — если не захочет.","- Дело в том, - говорит автолюбитель автоинспектору, - что я специалист-программист ЭВМ.\n- Теперь понятно, почему ваш талон предупреждений похож на перфокарту.","- Что ты пишешь? - спросили Программиста.\n- Сейчас запустим - узнаем! - ответил Программист.","Директор вызвал к себе нескольких сотрудников фирмы и обращается к ним:\n- Вы требуете, чтобы вам повысили зарплату. Администрация фирмы считает, что этого делать не следует. Разрешить этот спор я поручил нашему компьютеру. \n- Если он ответит, что вы правы, я повышу вам зарплату - за счет зарплаты программиста.","- У программистов есть свой собственный покровитель — святой Исидор.\n- К сожалению, больше ничего святого у них нет...","Купил программист стиральную машину. Через 2 дня приносит ее обратно!\n— Все забирайте этот девайс обратно! Вроде все входы и выходы слива и подачи воды прописал! А эта железка ни хрена не поднимается!\n— А вы ее к сети подключили!\n— А это еще зачем, чтоб она рецепты стирки из Интернета закачивала!","Пользователь приходит и говорит программисту:\n- Мне информацию в электронном виде надо. Ну, на дискете чтоб.\n- А в каком формате?\n- Как в каком? Ясно в каком - в А4.","Армянин-программист назвал сына Трафик…","Программисты зарабатывают тем, что находят и решают проблемы, а системным администраторам проблемы находят пользователи.","В автобусе молодой человек обращается к девушке:\n- Девушка, вы случайно не программистка?\n- Да, а как вы догадались?\n- У вас очень глупое выражение лица!\n- Дурак!\n- Да, я тоже программист...","Молитва программиста: \n- Во имя Отца и Сына и Святого Духа - ENTER. Молитва чайника:\n- Во имя Отца и Сына и Святого Духа - RESET!","В торговом центре уставший папаша: \n- Эх, сейчас бы ехать так не спеша и бутылочку пивка холодненького потягивать, на что ему ребенок лет девяти.\n- Тогда тебе, папа, нужно было не программистом работать, а гаишником.","Лежат два программиста на берегу моря, один другому:\n- Смотри какие облака.\n- Да.... это они умеют!","На уроке русской литературы. Учительница:\n- Учитесь ребята, а то останетесь на всю жизнь программистами...","- Как отличить наркомана от программиста?\n- А что для вас значит фраза: \"Отдай винт, а то я твою маму продам?\"","Устроился программист на работу в Мосэнерго. В первый же день проблема:\n- Ввели в строй новый жилой микрорайон, стало не хватать мощности. Что делать? Все чешут затылки, ничего не могут придумать. Программист:\n- Да что вы маетесь-то? Ресурсов системы не хватает? А библиотеки отключать пробовали?","- Вчера долго пытался объяснить бабуле, что работаю программистом...\n- ???\n- Короче, сошлись на том, что чиню телевизоры и развожу мышей...","Если программист признан незаменимым, то лучше, что можно сделать - избавиться от него как можно скорее.","Встречаются два программиста.\nПервый:\n- Слушай, откуда у тебя такой классный велик?\n- Да не поверишь. Сижу вчера на берегу, обдумываю новую программу, тут подъезжает ко мне такая красивая девушка на велосипеде, снимает с себя все и говорит: \n- Бери все, что хочешь. Ну, я и взял велосипед, а на хрена мне ее одежда?","- Директору пивзавода от группы программистов. Заявление.\n- Просим Вас предоставить выделенную линию со скоростью 0,5 л/сек.","Прочитал программист сказку про репку и говорит:\n- Не знаю, что они называют жучкой! Но итак понятно что без мышки никакая игрушка работать не будет!","- Сколько программистов нужно, чтобы поменять сгоревшую лампочку?\n- Двадцать. Один держит лампочку, а остальные 19 пьют пиво, пока комната не начнет сама крутиться.","На окне сидят два программиста.\n- Ты вон, за окном тополя видишь?\n- Ага.\n- Так у них обратной стороны нет.\n- Это ж почему?\n- Да программа с оптимизацией была - что не видно - то не рисует.","Приходит один программист другому:\n- Слышь, Петя, мне генератор случайных чисел нужен.\n- Четырнадцать!","Первый урок английского. Учительница:\n- Кто из вас, дети, знает все английские буквы.\nВовочка (программист маленький):\n- Я.\n- Hу называй, по порядку.\n- Q, W, E, R, T, Y...","Один программист говорит другому:\n- Подходит ко мне сегодня одна бухгалтерша и говорит - вот этот отчет мне надо сделать в программе сегодня к вечеру. Если я до конца рабочего дня не отдам его шефу, меня подвесят за ноги!\n- Да, женщинам жить легче!","Приходит девушка к программисту в гости, а тот:\n— Чай, кофе, интернет?","В трамвае:\n- Девушка! А девушка! А вы наверно программистка?\n- Да, но как вы догадались?!!\n- У вас очень глупое лицо!\n- ДУРАК!!!\n- Ага, я тоже программист...","Встречаются значит программист и технарь. Давай друг другу на жизнь сетовать.\nТехнарь:\n- Вот намедни программку написал, не работает сволочь, я и память заменил, и винт переставил, и проц перепаял - ничего не помогло.\n- Во-во, у меня, похоже, с дисководом проблема, я и ось переставил, и драйверок подправил, а на дисководе даже светодиод не загорается.","Приходит программист в библиотеку и говорит:\n— Позовите мне архивариуса! Мне надо его спросить!\n— Я его отправил в архив. Могу я вам помочь?\n— Разархивируйте его, он мне срочно нужен.","Сидит программист в баре, пьет пиво. К нему подходит девица:\n- Если хочешь хорошо отдохнуть сегодня, то меня зовут Бетти...\n- А если я не хочу сегодня хорошо отдохнуть, то как тебя зовут?","Вечеринка у компьютерщика-программиста. Хозяин, выпив сверх нормы, начинает приставать ко всем женщинам. Его жена хватает дубинку и бьет его по голове. Программист теряет сознание.\nОдна из женщин:\n- Катя, ну зачем же так?\n- Ничего... Перегрузится - успокоится.","Приходит с работы программист и слышит, как его жена на кухне соседке объясняет:\n— На работе все они программисты, только вот дома — пользователи.","Сидят два программиста у окна. Видят - за окном летающая тарелка. Один программер другому (сочувственно):\n- Ну вот, опять у кого-то диск полетел.","Чем отличается начинающий программист от законченного?\n- Начинающий думает, что в килобайте 1000 байт...\n- А законченный думает что в километре 1024 метра!","Пасхальный диалог верующего с программистом:\n- Христос воскрес!\n- А Стив Джобс?","286-й, зараженный вирусом, спрашивает программиста-философа:\n- Программист, я буду жить???\n- А смысл?","Объявление в газету в разделе трудоустройство:\n- Для ухода за пожилым программистом требуется приятная женщина, говорящая на BASIC, PASCAL и С++.","Приходят к программисту гости, а у него шум, гам. В общем, ссорятся между собой его дети. Гости спрашивают программера:\n- А чего у тебя дети так орут?\nА он им в ответ, оторвавшись от компа:\n- Конфликт версий.","— В чём особенность раздвоения личности у программистов?\n— Может быть много субличностей, но одна из них — обязательно — админ!","На работе пропал програмер. День нету, два. На звонки не отвечает. \n- Ну решили проверить что да как. Пришли к нему домой, а там в холодной ванне сидит лысый программист с полупустой бутылкой шампуня в руке. Отняли у него бутылку и читают инструкцию:\n- Нанести на влажные волосы. Намылить. Подождать. Смыть. Повторить...","Детсад, дети программистов обсуждают вопросы отношений между мужниной и женщиной. Более продвинутый мальчик объясняет другу:\n- Представь, что мужчина - это флэшка, а у женщины есть USB порт....","Утром программиста спрашивает его новая подружка:\n- (нежно) Ты на мне женишься?\n- (раздраженно) Каждый раз одни и те же вопросы! В FAQ!","Один программист любил компьютеры, и однажды его застукали за этим делом.","Умирает 30-летний программист. Вот стоит он перед вратами рая, около них стоит святой Петр и читает книгу жизни.\nПрограммист:\n- Боже, за что ты меня забрал, я же такой молодой, еще только 30 лет, жить да жить.\nСвятой Петр, не отрываясь от книги:\n- Не знаю, не знаю, по тайм-репортам тебе уже 96 лет.","Программисту выносят из роддома девочку. Программист:\n- Скажите, а где можно сделать ее апгрейд?","- Российские программисты доказали, что Карлсон - это компьютерный глюк.\n- Он появляется только, когда у Малыша открыты окна.","Утро. Хмурый как туча программист входит на кухню с благородной целью чем-ни буль подкрепиться после бессонной ночи, проведенной за родным пнем. Через какое-то время на кухне появляется жена, и, заметив, мягко говоря, херовое настроение своего супруга, спрашивает:\n- Что, Васенька, программа не заработала?\n- Заработала!..\n- Что, может... неправильно заработала?\n- Да правильно заработала... мать ее за ногу!..\n- Васенька, а почему же ты тогда такой хмуренький?\n- На бэкспейсе вздремнул!!","- Есть такая профессия — инженер-программист.\n- Работаешь, как программист. Платят — как инженеру...","Программист увидел HЛО:\n- У кого-то диск полетел...","Один программист узнает у другого:\n— Ты на какое печатное издание подписался?\n— А для чего мне издание, если имеется Интернет?\n— А в санузел с клавиатурой ходить будешь?","Подходит маленький сын к отцу-программисту и спрашивает его:\n— Пап, а правда, что от интернета люди тупеют?\n— Гы, сынок...","Едет из Москвы домой студент-программист. Бухнул малость, заснул в руках с книжкой «теория полей». Утром все проснулись, кроме студента. Проводница видит заглавие на его книжке — «Теория полей» и будит:\n— Вставай, агроном.","Приходят к программисту гости, а у него шум, гам. В общем ссорятся между собой его дети. Гости и спрашивают программера: \n- А чё типа у тебя дети так орут?\nА он им в ответ, оторвавшись от компа:\n- Ничего не поделаешь - конфликт версий!","Сидит как-то программист, налаживает свою пятилетнюю работу, обложился справочниками, документацией, неделю сидит - ни фига не получается. Мужик уже похудел весь, зарос щетиной... \n- Тут входит в комнату его мама и говорит ему с горечью в голосе:\n- Ну что, все играешь???","- Сколько программистов фирмы MicroSoft требуется, чтобы заменить перегоревшую лампочку?\n- Ни одного - темнота будет объявлена новым стандартом.","Разговор 2-х программистов:\n- Ты не боишься что однажды придя на работу ты найдешь на столе розовый бланк с уведомлением что тебя увольняют?\n- Не, не боюсь, рабов не увольняют, их обменивают...","- Почему программист любит компьютер больше, чем жену?\n- А где ты видел комп, который отвечает: \n- Отстань, у меня голова болит.","- Что делает программист после запоя наутро?\n- Тестирует память.","Программист коллегам:\n- Сегодня на работе опять весь день онанизмом занимался.\n- Че, винды переставлял?\n- Да нет... просто дрочил.","Уволили одного программиста с работы. Кое-как устроился он садовником. В\nпервый рабочий день послает его бригадир кусты в парке стричь и говорит:\n- Знаю, что ты программист, не требую идеально ровно, но постарайся, \nчтобы было хотя бы \"более или менее\".\nВ конце дня решил бригадир проверить как новый работник кусты постриг.\nПришел в парк и обалдел, все сделано криво, страшно, даже двух одинаково\nпостриженных кустов нету. Рассердился он и стал ругать бывшего\nпрограммиста:\n- Что ты, наделал? Так я просил тебя кусты стричь? Это называется\n\"более или менее\"?\nА программист ему отвечает:\n- Так ведь \"более или менее\" значит \"не равно\".","Перепись населения у программиста:\n— Ваш родной язык.\n— Как это родной язык?\n— Ну, какой Вы язык с детства изучали, всю жизнь использовали?\n— Bаsiс.\n— Да нет, настоящий.\n— А! Настоящий! Тогда Си.","— Что делать, если система не работает?\n— Программист должен из нее выйти и опять войти.\n— Что делать, если программист не работает?\n— Начальник должен в него войти и выйти. Несколько раз...","Директор вызывает системного администратора:\n— Ты зачем дал доступ к данным о наших клиентах программисту? А вдруг он продаст эти данные нашим конкурентам? Это же нанесет колоссальный ущерб фирме.\n— Ну что вы, парень он честный. Обещал поделиться...","Приходит программист домой и говорит жене:\n— Я голоден, как 256 чертей!","Один программист, радостно:\n— Я тут с девушкой познакомился — красивая, обалдеть!\nВторой, настороженно:\n— А ты ее во всех браузерах видел?","Возвращается программист в восемь вечера с работы домой. Жена спрашивает:\n- Ты почему так рано?\n- Мама умерла.\n- А я тебя предупреждала, что она долго не протянет с палёным китайским кулером!","- Для решения какой комплексной проблемы создаётся группа из следующих специалистов: физик, биолог, химик, инженер, врач, архитектор, экономист, программист?\n- Для уборки картошки в совхозе.","Если бы я не был программистом, я, наверное, хирургом бы стал: \n- Люблю, знаете ли, поковыряться во всякой фигне непонятной.","- У тебя есть программа, которая меняет форматы?\n- Не понял?\n- Форматы говорю мне нужно поменять.\n- Какие форматы?\n- Ты что, тупой? .. форматы Фото, естественно!\n- Каких конкретно файлов?\n- Ты настоящий тормоз, а еще программист!. КОМПЬЮТЕРНЫХ фото, понимаешь, КОМПЬЮТЕРНЫХ!","Звонит на радио в программу по заявкам программист и просит:\n— Поставте пожалуйста песню группы Любэ про загрузку компьютера.\nD.J:\n— Я про такую песню не слышал.\n— Как не слышал com.bat батяня com.bat.","Купил себе однажды программист машину. Ну, решил на радостях со всей семьёй и тёщей поехать в лес, на пикник...\nЕдут они едут - тут вдруг заглохла машина. Что делать? \nВысадил жену - не заводиться машина, высадил детей - то же самое, высадил тёщу - не заводится, вытащил все вещи... И... машина завелась. \nЖена радостно спрашивает: \n- Петенька, золотце - что ты сделал?!! \n- Да не знаю... ПЕРЕЗАГРУЗИЛСЯ!","Разговаривают два программиста:\n- А что он собой представляет?\n- Очень общительный и доброжелательный, даже не скажешь, что программист.","— Что значит «Грабь награбленное», — спросил сын своего папу-программиста.\n— Это когда пиратский аудио-диск перегоняешь в mр3.","Сын спрашивает у папы программиста:\n- Пап, откуда дети берутся?\n- Отстань сынок, я занят, спроси у Яндекса!","- А какое сегодня число? - спросил уставший программист.\nВторой не задумываюсь отвечает: \n- Целое, положительное!","Сегодня программирование - это соревнование между программистами, пытающимися писать все более \"дуракозащитные\" программы и Природой, создающей все более тупых пользователей. Пока что природа побеждает.","Встречаются два программиста.\n- Как дела?\n- Да вот, с досом проблемы.\n- А что случилось: компьютер не грузится, соmmаnd.соm виснет или что-нибудь другое?\n- Да дет! У меня дасмогк!!!","Программист звонит коллеге:\n— У меня заболел пудель. Помнится вы говорили, что у вас болел ваш спаниель. Что вы предпринимали?\n— Я дал собаке диметилизоглюконат.\nЧерез день первый снова звонит:\n— Я дал пуделю этот глюконат — и он сразу сдох!!!\n— Да-да, мой спаниель тоже сдох сразу...","У программиста спрашивают:\n- Как вы считаете, сколько обычно занимает половой акт?\n- Ну, всегда по-разному, но в большинстве случаев не менее 2 Мб.","Жена отправляет своего мужа-программиста в магазин. \n— Значит так, купи палку докторской колбасы. Понятно? Да, и ещё, если будут яйца — купи десяток. \n— Хорошо, — сказал муж и принес десять палок колбасы. \n— Почему так много? — спрашивает жена. \n— Ну, яйца в магазине были, вот я и купил десяток, как ты и просила.","Муж-программист (М) с женой (Ж) сидят в цирке на выступлении иллюзиониста. Во время очередного номера из небольшого ящика выходят много девушек.\nЖ: \n- Как они могли поместится в таком маленьком ящике?...\nМ: \n- Ерунда! Если бы он использовал WinRAR он бы еще больше их туда запихнул...","Программист просит у друга денег в долг:\n- Одолжи 250$ до получки, ну или для ровного счета 256?","Сидит программист в столовой, обедает, суп ест. В очках такой, задумчивый, программу думает. Народу никого, все уже поели, ушли. Подходит к нему официантка и заигрывает:\n- Если Вы хотите хорошо провести время, то меня зовут Маша!\nПрограммист медленно возвращается на землю и смотрит на официантку отрешенным взглядом и на автопилоте спрашивает:\n- А если не хочу, то как Вас зовут?!","Едет программист за рулем. Вдруг машина останавливает и дальше ну никак не едет. Водитель и так, и эдак... Программист и советует:\n- А вы закройте лишние окна. Поможет...","Сынишка, узнавая значения неизвестных слов, подходит к папе:\n- Пап, а что такое геморрой?\n- Ты что, с программистами общался?","Сидит как-то программист за своим компом, играет в TETRIS, попивает пиво и вдруг звонок в дверь. За дверью стоит его бывшая подруга, которая опустив глаза говорит:\n- Вася, я беременна!\nПрограммист виснет, перезагружается и спрашивает:\n- Abort, Retry, Ignore, Fail?","Программиста спрашивают: \n- Сколько у вас детей? \n- Два сына. \n- А сколько им лет? \nПосле паузы: \n- Один на компе играет, а второй нет.","Приходит программист утром на роботу, а там два грустных сис.админа сидят.\n Ну и что мы такие грустные?!\n- Да мы вчера в офисе допоздна сидели…\n– Пиво пили…\n– Пароли меняли…","Сидят два программиста в кафе. Мимо идет шикарная телка.\n- Классные у нее properties, - говорит один.\n- Вчера проверял... Все read only, - с грустью отвечает другой.","Встречаются два бывших одноклассника. Один - новый русский, а другой - программист. Первый спрашивает второго:\n- Ну что, братан, как дела?\n- Да вот, уже почти год сижу на Яве, пишу всякие приложения.\n- Ну ты крут! Впрочем, я тоже в этом году на Кипре две недели пробыл.","Приходит жена программиста с работы, а муж весь расстроенный.\n— Миша, что случилось?!\n— Мама умерла... Да погоди радоваться, не моя — у компа...","Программист засиделся поздно. Жена уже легла спать, а он полез в интернет на порносайт. Вдруг жена встала, подошла к нему сзади стоит, смотрит. Через некоторое время говорит: \n- Верни-ка предыдущую фотку. Еще одну. Вот - хочу такие занавески на кухню...","Жена программиста:\n- Дорогой, у нас будет ребёнок!\nПрограммист:\n- Ты хочешь сказать, что я некорректно вышел?","Два программиста едут в переполненном автобусе.\nОдин - другому:\n- Что то у меня с писюком! (толпа замирает)\n- А что с ним?\n- Да встает часто...\n- Может вирус какой?\n- Да проверял, все стерильно...\n- А висит хорошо?\n- Крепко, тремя пальцами не поможешь...","День рождения программиста. Жена говорит тост:\n— Желаю тебе такую скорость интернета, как ты кончаешь!","Блондинка спрашивает программиста:\n— И что делать с этой программой?\n— Установи и крякни.\n— Установила и крякнула ничего не работает.\n— Ты как крякала?\n— Как уточка..","Задачка, которую хороший программист решит за пару минут, а хороший физик сойдет с ума: - Ася весит 4,2 метра. За сколько времени она скачается, если ширина канала — 5 кило в секунду?","Смотрит программист телевизор. Идут титры. Программист говорит:\n- Черт, как эти фильмы долго грузятся!","Сидит программист, пишет программу, вдруг, стук в дверь. Открывает — а там смерть с косой! Программист:\n— Не забирай меня сейчас, дай программу дописать!\nСмерть:\n— А я не за тобой, я за твоим винчестером.","Программиста спрашивают:\n— Скажите, который час?\n— «Который час», если Вас это прикалывает.","Приходит программист с работы, а на него жена набрасывается с кулаками.\n- Сволочь, подонок! Я столько лет тебя кормила, поила, ублажала, а ты, падла, мне изменяешь!\n- С чего ты взяла?!!\n- Не прикидывайся! Звонил Витька, спрашивал номер твоей Аськи!","- Сколько программистов нужно, чтобы сменить перегоревшую лампочку?\n- Ни одного. Это Hardware Problem.","Сочи. Пляж. Лежат на нем две обалденной красоты девушки. Мимо идет парень, увидел таких красавиц, остановился и спрашивает:\n— Девушки, а как вас зовут?\nМолчание.\n— Девушки, а откуда вы приехали?\nМолчание.\n— Девушки, а что вы делаете сегодня вечером?\nОдна поворачивается к нему и говорит:\n— Молодой человек, где вы работаете?\n— Программистом.\n— Представьте себе, молодой человек, вот вы приехали отдыхать, пришли на пляж, а здесь сплошные компьютеры!\n— У-у, КАЙФ!","Чем юзер отличается от программиста? Если попросить их перезагрузить комп пользуясь только мышкой, юзер жмет на ”завершение работы” в Виндовсе. А что сделает программист? Он поднимет мышку со стола и нажмет ею на Reset.","Как-то летели Холмс с Ватсоном на воздушном шаре. И заснули. Просыпаются над какой-то незнакомой местностью, видят — внизу какой-то мужик коров пасет. Снизились они и спрашивают мужика:\n— Скажите, сэр, где мы находимся?\n(долго думал)— На воздушном шаре.\n— Спасибо, сэр! — и поднялись вверх. Холмс задумчиво говорит:\n— Интересная местность, Ватсон! Программист пасет коров!\n— Но, Холмс, с чего вы взяли, что он программист?\n— Это элементарно! Во-первых, он долго думал над ответом. Во-вторых, его ответ был абсолютно точен. И самое главное — абсолютно бесполезен!","Два основных правила программиста: \n- Чудес не бывает. \n- Дерьмо случается.","Советы от синего экрана монитора:\n1. Нервные клетки не восстанавливаются.\n2. Учи английский язык.\n3. Настало время завести друга-программиста.","В кафе парень пытается познакомиться с девушкой:\n- Девушка, вы программист?\n- Да, а как вы догадались?\n- А у вас лицо глупое.\n- Да это у вас лицо глупое!\n- Я тоже программист...","Программист вбегает в милицию:\n— У меня автомобиль пропал!\n— Опять вы! Да не пропал он никуда, стоит где оставили... Запомните, 404 — это его госномер!!!","Идет программист по улице. Встречает девушек.\n- Девушки, хотите пива?\n- Нет.\n- Вино?\n- Нет!\n- Водку?\n- Нет!!\nПрограммист думает про себя: \n- Странно, стандартные драйверы не подошли.","- А я на прошлой неделе женился!\n- Поздравляю! Она тоже программист?\n- Нет.\n- Опа… а о чем вы с ней тогда разговариваете?!","- Сколько нужно программистов,чтобы покрасить забор?\n- Три бригады. Первая подготавливает демо версию забора, вторая-основную, а третья исправляет предыдущие недостатки и перекрашивает забор заново.","Для начальников!\n- Прежде, чем обидеть программиста - посчитайте, стоят ли ваши глупые амбиции таких затрат для вашей фирмы, когда он захочет вас обидеть...","Блондинка — программисту:\n— Что делаешь?\n— Собираю новый компьютер.\n— А зачем ты разбирал новый компьютер?","- Можно ли загадать желание, если сидишь между двумя программистами?\n- Можно! Только глючить будет.","Программист не стал креативить и назвал детей Новый сын (1) и Новый сын (2).","Два программиста:\n- Ещё одно неловкое движение с твоей стороны…\n- И???\n- И… счётчик твоих неловких движений увеличится на единицу.","Менеджер: Как там наш проект?\nПрограммист: Утонул в потоке новых сверх-супер-экстра-мега-сука-срочных задач, которые сыплются каждый день как \"шарики\" у козы из под хвоста.","Программисты, он и она, лежат в постели и отдыхают после занятий любовью.\nОна: \n- Не хочешь повторить процедуру?\nОн: \n- Функция еще не вернула значения.","Окончил программист институт и устроился на работу. Начальник спрашивает:\n- Вы сильный программист?\n- Ну как вам сказать...\n- Ну сильный?\n- Вообще да.\n- Тогда займешься перетаскиванием компьютеров.","Разговор двух программистов:\n- Что пишешь?\n- Сейчас запустим - узнаем!","- Чем отличается законченный программист от простого пользователя?\n- Пользователь думает, что в килобайте 1000 байт, а Программист думает, что в километре 1024 метра.","Пошли как-то с женой в магазин. Как обычно купили всяко-разно по мелочи. Вышли, ждем дочь. Черт дернул почитать чек, и впали в ступор: \n- СВИНЯБЛ.\nПодумали... Просмотрели пакеты... Опять подумали. Ну не брали мы Свинябла, нам и так нормально... Подошедшая дочь вернула к жизни старых маразматиков: \n- СВИНЯБЛ — Сок ВИНоградно ЯБЛочный. Ох уж эти фискальные принтеры да экономные программисты...","Программиста спрашивают:\n- Как вам удалось так быстро выучить английский язык?\n- Да, ерунда какая. Они там почти все слова из C++ взяли.","- Чем отличается программист от админа?\nНаблюдение со стороны: \n- Программист бубнит себе под нос «логично» каждый раз, когда ковыряется с проблемой, админ бубнит «странно.","Разговор двух программистов:\n- У одного моего знакомого четверо детей. Каждый следующий светлее предыдущего.\n- Картридж пусть проверит.","- Как отличить наркомана от программиста?\n- Задать контрольный вопрос - что для вас значит фраза: \n- Отдай винт, а то я твою маму продам?","Программист:\n- Сегодня у сына день рождения.\n- И сколько ему исполняется?\n- 1024 дня.","— Чем хороший программист отличается от плохого?\n— Плохой пишет вирусы, а хороший — антивирусы.","Программист жене:\n— СD молча и не DVD меня до белого каления!","Разговаривают два программиста:\n— Бля. А у меня духовка не включается...\n— Как так?... что пишет?","На работе. Директор:\n- Знаете, молодой человек, мне кажется, что Вы начинаете работать только тогда, когда я на Вас обращу внимание. И не надо сразу так активно полы мыть. Вы у нас программистом работаете.","- Вовочка, а кто у тебя папа?\n- Программист.\n- А ты считать до 5 умеешь?\n- Умею.\n- Посчитай.\n- Один, два, три, четыре, пять...\n- А дальше ?\n- Шесть, семь, восемь, девять, а, бэ, цэ, дэ, е, эф...","Зовет директор к себе программистов и сисадмина.\n- Какая сволочь удалила мой доступ к сети! Уволю на хрен!\n- ????\n- Еще раз спрашиваю - кто удалил?\nСисадмин: \n- Я не удалял...\nПрограммисты: \n- Мы тоже не удаляли!\n- Тогда объясните мне, что это? Вот папка \"Сетевые подключения\", видите?\nА вот значок - \"Удаленный доступ к сети\"... Последний раз спрашиваю - по-хорошему - КТО УДАЛИЛ???!!!","Блондинка спрашивает программиста:\n— И что делать с этой программой?\n— Установи и крякни.\n— Установила и крякнула ничего не работает.\n— Ты как крякала?\n— Как уточка..","Функция будильника еще поспать ввела программиста утром в бесконечный цикл.","Разговаривают два программиста.\n- Слушай, вчера написал новый архиватор. Любой файл сжимает в 5 байт.\n- Ну просто рулез!\n- Ага. Сейчас работаю над раз архиватором...","Жена отправляет мужа-программиста в магазин:\n– Купи батон хлеба, если будут яйца – возьми десяток.\nМуж возвращается из магазина с 10 батонами.\n– Ты зачем столько хлеба купил?\n– Так ведь яйца были.","Жена разбудила ночью мужа-программиста:\n— Дорогой, у нас мышь пищит, мне страшно!\n— Так ты выдерни её из системника!","Один программист другому:\n- Вот представь: \n- У тебя есть 1000 рублей... Или, для круглого счета, пусть у тебя 1024.","Поздняя осень. У окна стоят два программиста, новичок и матерый, курят.\nНовичок (восторженно):\n- О, снег падает!\nМатерый (задумчиво, не отрывая взгляда):\n- Да, 15 килобайт в секунду….","Жена посылает программиста за продуктами:\n— Купи палку колбасы, и если будут яйца, возьми десяток.\nПрограммист в магазине:\n— Дайте мне, пожалуйста, палку колбасы. Спасибо. А яйца у вас есть?\n— Есть.\n— Тогда ещё девять палок колбасы.","Беседуют два программиста.\n- Чем программист отличается от обычного смертного?\n- А тем, что в состоянии ответить на вопрос, в котором уже заключен ответ.\n- Это как же?\n- Ну, например, ответь на вопрос: сколько будет 2х2=4?\n- ТRUЕ!","Разговор программиста с женой:\n- Ты слыхала,что через 10-15 лет станет возможным иметь секс с компьютером?\n- А тебе-то что? Для тебя ничего не изменится...","Перепись населения у программиста:\n- Ваш родной язык.\n- Как это родной язык?\n- Ну какой Вы язык с детства изучали, всю жизнь использовали?\n- Basic.\n- Да нет, настоящий.\n- А! Настоящий! Тогда Си.","Приходит программист к окулисту. Тот его усаживает напротив таблицы, берет указку:\n- Читайте!\n- БНОПНЯ... Доктор, у вас что-то не то с кодировкой!","Домашняя идиллия в семье программиста. Папа смотрит телевизор. Сынишка выходит из-за компьютера и спрашивает:\n- Папа, а что означает \"Format drive C: comрleted\"?","Лучшие умы человечества собрались на научную конференцию, обсуждается вопрос: \n- Сколько будет дважды два.\nИнженер колдует с рулеткой и логарифмической линейкой, после чего уверенно объявляет результат: \n- 3,99.\nПрограммист обратился в службу технической поддержки, поставил численный эксперимент на компьютере и доложил: \n- Между 3,98 и 4,02.\nМатематик посмотрел в потолок, подумал и сказал, что точного ответа он не знает, но зато может доказать, что этот ответ существует. Логик попросил более точно определить, что такое \"дважды два\". Философ полчаса рассуждал о том, что \"дважды два\" можно понимать совершенно по-разному. Хакер предложил взломать защиту секретной сети Пентагона и заставить все компьютеры решать эту проблему.\nНаконец, бухгалтер сказал:\n- Закройте все двери и окна, а теперь ответьте - а сколько вы хотите получить?","Приходит сын к папе-программисту и спрашивает:\n- Папа, а как пишется \"адрес\", с двумя \"с\" или с одной?\nОтец отвечает:\n- С тремя \"W\",сынок!","Сын-программист не заморачиваясь называет очередного ухажера своей ​мамы \"новая папка 2\"","Один программист другому: \n- Вчера всю ночь за компьютером просидел, программу писал, аж уснул за клавой. \n- И как, работает? \n- Нет, я когда засыпал, «Del» нажал.","Объявление в газете:\n— Требуется программист со знанием ПК.","Сидит программист глубоко в отладке.\nПодходит сынишка:\n- Папа, почему солнышко каждый день встает на востоке, а садится на западе?\n- Ты это проверял?\n- Проверял.\n- Хорошо проверял?\n- Хорошо.\n- Работает?\n- Работает.\n- Каждый день работает?\n- Да, каждый день.\n- Тогда ради бога, сынок, ничего не меняй.","Жена посылает программиста в магазин:\n- Дорогой, купи, пожалуйста, палку колбасы, и если будут яйца, то купи десяток.\nЧерез полчаса программист возвращается с десятью палками колбасы. Жена:\n- Что это?! Зачем ты купил столько колбасы?\nПрограммист:\n- Ну так яйца-то были...","В отделе кадров:\n- Вы что-то выглядите недостаточно подвижно для своего возраста.\n- А вам кто нужен: \n- Программист или обезьяна?","Анекдоты Первый урок английского. Учительница:\n- Кто из вас, дети, знает английский алфавит? Сын программиста:\n- я.\n- Ну, называй по порядку.\n- Q, W, Е, R, Т, Y...","Программист приглашает девушку в гости:\n- Приходи завтра, чай попьем, кино посмотрим.\n- Хорошо. Только я номер квартиры не помню. \n- 384. Запомнить просто! Две планки памяти 256+128.","Программист стал священником. Свою первую литургию он завершил словами:\n- Во имя Отца, Сына и Святаго Духа. Enter.","Из форума программистов:\n— Помогитенеработаетпробел!!!\n— Настоящие_программисты_пробелами_не_пользуются.","Программист рассказывает своим друзьям, таким же, как он:\n- Вчера в ночном клубе я познакомился с клевой блондинкой!\n- Ух ты!\n- Потом я пригласил ее к себе, мы с ней выпили, я начал ее ласкать.\n- Здорово!\n- Тут она мне говорит: \"Раздень меня!\"\n- Клево!\n- Я снял с нее трусы, положил ее на стол и прямо на клавиатуре...\n- Ни хрена себе, ты купил себе комп? А процессор какой?\nБлондинка - подругам:\n- Вчера я познакомилась с программистом в ночном клубе.\n- Ух ты!\n- Потом он пригласил меня к себе, мы с ним выпили, и он начал меня ласкать.\n- Здорово!\n- И тут я ему сказала: \n- Раздень меня!\n- Клево!\n- Он снял с меня трусы...\n- Ни хрена себе, ты что, в трусах ходишь???","- Сколько программистов нужно, чтобы вкрутить лампочку?\n- Ноль, это проблема на стороне железа.","К программисту домой пришла смерть. А он как раз программу пятые сутки писал. Долбался долго и нудно, а тут еще и смерть. Вот облом! Открыл программист дверь и прямо с порога кинулся ей гнилые ножки целовать:\n- Смертушка, хорошая моя, сладкая моя, дай мне еще 5 минуточек, мне только программку написать! Мне строчечку последнюю начирикать, программу запустить и можешь забирать, куда хочешь...\n- Да расслабься, мужик! Я не к тебе, я к твоему винчестеру.","Просыпается программист с большого бодуна, поворачивается, а рядом какая-то девушка лежит.\n- Оорs, обнаружено новое устройство...","Программист решил занять у друга 1000 рублей, но для ровного счёта занял 1024.","- Зачем компьютеры пищат, когда нажимаешь сразу много клавиш?\n- Чтобы будить уснувших на клавиатуре программистов!","Стоит программист возле окна – закрывает, открывает. Закрывает, открывает. Подходит второй и спрашивает:\n- Что ты делаешь?\n- Ну, прикинь: закрыть могу, открыть могу, а свернуть – не могу!","Страдает программист:\n- Эх, никто меня кроме Google с полуслова не понимает.","Народная примета: \n- Если программист в девять утра уже на работе, значит, он еще на работе.","Для программиста монитор - это реальный рабочий стол, системный блок - журнальный, а клавиатура - обеденный.","Семья программистов.\n— Зайди сюда!\n— Куда, нет ссылки?!\n— НА КУХНЮ ЗАЙДИ!!!","Программист ставит себе на тумбочку перед сном два стакана. \n- Один с водой - на случай, если захочет ночью пить. \n- А второй пустой - на случай, если не захочет.","Сижу дома у брата, смотрю телевизор. Тут ко мне подбегает 3-летний племянник:\n- Дядя Боря, а кто такой программист?\n- Лучше спроси у мамы, она лучше расскажет.\nПлемянник довольный убегает на кухню, через некоторое время возвращается:\n- Мама сказала, что ты объяснишь мне, кто такие программист и стрелочник.","Вовочка пришёл в зоопарк, увидел обезьян и давай кричать-Мама! мама! программисты! - почему ты так решил? \n- А они на папу похожи - немытые, лохматые и у них мазоль на заднице!","Опытный программист Вова из Калифорнии подъехал на собственном БМВ к собственному калифорнийскому дому. На столе было калифорнийское вино и пельмени. За столом сидели китайская, мексиканская и русская манекенщицы.\n— С чего начнем? — спросил программист.\n— С лечения белой горячки, — ответили хором девки.","Тонет программист. И во все горло орет:\n- F1, F1, F1, тьфу ты, помогите, помогите, помогите!!!","- Вчера долго пыталась объяснить бабуле, что работаю программистом \n- Удалось? \n- Короче, сошлись на том, что чиню телевизоры и развожу мышей","Человек, который думает, но не знает, есть ли в его холодильнике пиво, и...\n- вычисляет разницу между тем, что было куплено, и тем, сколько перед ним пустых бутылок - математик;\n- ставит веб-камеру в холодильник - инженер;\n- придумывет прозрачный холодильник - промышленный дизайнер;\n- пишет приложение для смартфона по подсчету оставшихся бутылок пива в холодильнике - программист;\n- взвешивает холодильник и путем вычитания массы всех остальных продуктов определяет наличие пива - физик;\n- утверждает, что пиво одновременно и есть и нет, пока не откроешь холодильник - Шредингер.","Программист после напряженного трудового дня залезает в холодильник, достает пачку масла, читает на обертке: \n- Масло сливочное. 72%. В голове быстрая мысль: \n- О! Скоро загрузится! Возвращает масло в холодильник. Закрывает дверцу.","Приходит студент-программист на занятия с утра злой. Его одногрупники спрашивают:\n- Ты чего такой злой?\n- Да программу вчера всю ночь набивал.\n- И что, не заработала?\n- Да нет, заработала.\n- Может, неправильно заработала?\n- Да нет, правильно.\n- А что тогда?\n- Да на Backspace уснул…","Программист с женой отправились в супермаркет. Сделав все необходимые закупки, они вышли на улицу, и жена сказала:\n- Стой здесь и смотри в оба за этими десятью сумками, пока я схожу и разыщу такси.\nКогда жена вернулась, то увидела обалдевшего мужа, переставляющего сумки с места на место.\nПрограммист:\n- Ты сказала, что здесь десять сумок, а я насчитал только 9!\nЖена:\n- Но их было десять!\nПрограммист:\n- Нет, давай вместе считать: \n- 0, 1, 2, 3...","- Почему ваши дети все время ссорятся?\n- Kонфликт версий, - отвечает программист.","Шерлок Холмс и доктор Ватсон летят на воздушном шаре. Погода портится, шар несется по ветру с огромной скоростю, оринетация полностью потеряна... \nНаконец небо расчищается, Холмс и Ватсон видят под собой залитую солнцем природу. На берегу ручейка мужик пасет коров. Когда шар пролетает над мужиком,Холмс обращается к нему: \n- Любезнейший, не подскажете ли, э-э..., где мы находимся? \nМужик обалдело смотрит на Холмса и Ватсона, и, когда шар уже улетел довольно далеко, кричит ему вдогонку: \n- Вы находитесь на воздушном шаре!! \nХолмс: \n- Все ясно, Ватсон. Мы в России. \n- Но Холмс! Почему вы решили... \n- Элементарно, Ватсон. Этот человек - системный программист. Только системный программист мог дать столь правильный и при этом столь бесполезный ответ. \n- Да, но почему вы решили, что мы именно в России? \n- Элементарно, Ватсон. Только в России системные программисты пасут коров.","Программисты на работе общаются двумя фразами: «непонятно» и «вроде работает».","- Хуже всего приходится программистам из Microsoft.\n- Им, бедолагам, в случае чего и обругать-то некого.","В офисе:\n— Какая сволочь оставила судоку в туалете?! Программист уже полчаса оттуда не выходит! А снаружи очередь!","Жена спрашивает мужа-программиста:\n- Дорогой, почему до свадьбы ты был такой хороший и вежливый? Помню, даже цветы мне дарил...\n- Ну, милая, то была dеmо-vеrsiоn...","Почему программисты не живут отдельно от родителей?\n- Не хотят чтобы отключилась функция авто заполнения холодильника.","Почему программисты могут делать два проекта одновременно?\n - У них две руки. \nПочему дизайнеры могут делать два проекта одновременно? \n- У них два глаза. \nПочему тестеры могут делать два проекта одновременно? \n- У них два уха. \nПочему менеджеры могут делать только один проект? \n- У них одна жопа.","Стоит взвод молодых бойцов. Старшина:\n- По порядку номеров рассчитайсь!\nСолдат-программист:\n- Можно вопрос?\n- Можно...\n- А в какой системе? Десятичной? Шестнадцатеричной?\n- Для дураков объясняю, в десятичной!\n- Понял! Нулевой!","Девушка-программист, недавно вышедшая замуж, пишет матери по электронной почте: \n- Мама, мой муж оказался настояшим сексуальным маньяком! Он требует спать с ним везде: на кухне, в ванной, на подоконнике и даже за компю ыдвоа афп шгвыитр иядмвщжтич","- Заходит программист в лифт, а ему надо на 12-й этаж.\n- Нажимает 1, потом 2 и начинает лихорадочно искать кнопку Enter.","Из жизни программистов:\n- Премия в 12000$ была выплачена вчера хакеру, научившемуся сохраняться в «Сапере».","Армянское радио спрашивают:\n- Для чего нужны бухгалтерские программы?\n- Как для чего? Для снижения безработицы, конечно! Там, где раньше сидел один бухгалтер, теперь сидят еще оператор, программист, электронщик, пять наладчиков и начальник отдела вычислительной техники.","Системному программисту на день рождения подарили чемодан. Он и спрашивает:\n- Зачем?\n- Ну, как, - говорят, - ты же в командировки там всякие ездишь системки отлаживать?\n- Ну... \n- Ну, так вот: сюда трусики положишь, сюда носочки, сюда...\n- Стоп, стоп, ребята! А в чем же я сам поеду?","У чайника не работает программа. Он приходит за советом в комнату, где\nсидят юзер, программист и хакер.\nЮзер: Вот смотри, я сейчас звоню в службу поддержки, и они через неделю\nрешат твою проблему...\nПрограммист: Вот смотри, я сейчас напишу программу и через час твоя\nпроблема решена...\nХакер: Вот смотри, я сейчас запущу на твой компьютер вирус, и через\nминуту ты уже забудешь про возникшую проблему...","- Настоящий программист всегда должен ложиться спать или в 1:28 или в 2:56... Ну, на крайний случай, в 5:12.\n- А вставать в 10:24. Ну, на крайний случай, в 20:48.","В поезде едут 3 юзера и 3 программиста.\nУ юзеров 3 билета, у программистов 1. Заходит контроллер.\nЮзеры показывают билеты, программисты прячутся в туалет. Контроллер стучится в туалет, оттуда высовывается рука с билетом. Программисты едут дальше.\nНа обратном пути. У юзеров 1 билет, у программистов ни одного. Заходит контроллер.\nЮзеры прячутся в туалет. Один из программистов стучит, из туалета высовывается рука с билетом. Программисты забирают билет и прячутся в соседний туалет. Юзеров ссаживают с поезда.\nВывод — не всякий алгоритм, доступный программисту, доступен юзеру.","Программист звонит в библиотеку.\n— Здравствуйте, Катю можно?\n— Она в архиве.\n— Разархивируйте ее пожалуйста. Она мне срочно нужна!","Жена посылает мужа-программиста в магазин: \n- Купи батон колбасы. Да, и спроси, есть ли яйца. Если есть - возьми десяток. \nПрограммист приходит в магазин: \n- Батон колбасы, пожалуйста. Ага, спасибо. А яйца у вас в продаже есть? \n- Есть. \n- Тогда, пожалуйста, ещё девять батонов колбасы.","- По радио сообщили о переходе на зимнее время, сказав, что «этой ночью, ровно в 03:00 нужно перевести стрелку часов на один час назад, на 02:00».\n- У всех программистов эта ночь зависла в бесконечном цикле.","Если бы программисты были врачами, им бы говорили «У меня болит нога», а они отвечали «Ну не знаю, у меня такая же нога, а ничего не болит».","Работа программиста и шамана имеет много общего - оба бормочут непонятные слова, совершают непонятные действия и не могут объяснить, как оно работает.","Из комбинации лени и логики получаются программисты.","Девушка пришла в гости к программисту. Прошли на кухню, он ставит чайник. Она:\n- У тебя на столе такая чистота! Молодец! Обычно у парней кружки, тарелки, крошки...\nОн про себя: \n- Что я дурак что ли тут жрать?! У меня компьютерный стол для этого есть!","Это уже потом я понял, что соседи пришли именно ко мне, решив, что раз я учусь на программиста, то у меня должен быть Интернет, а, значит, я смогу найти то, что их интересует. Но поначалу я впал в лёгкий ступор, когда ко мне постучали и сказали:\n— Юрочка, ты же программист? Нам тут надо кастрировать кота...","Приходит программист к другу-пианисту – посмотреть на новый рояль. Долго ходит вокруг, хмыкает, потом заявляет:\n- Клава неудобная – всего 84 клавиши, половина функциональных, ни одна не подписана; хотя... шифт нажимать ногой – оригинально...","Умер программист. Попал на страшный суд. Судили-рядили - ни то, ни се.\n- Куда сам-то хочешь: \n- В ад или в рай?\n- А посмотреть можно?\nПривели его в громаднейший ВЦ. Кругом машин всевозможных, сеток - видимо-невидимо.\n- Вот это - рай, будешь здесь юзером.\n- А ад?\n- А ад здесь же - только системщиком...","Заболела жена программиста. Чихает, насморк у нее. Звонит ее подруга. Трубку берёт муж:\n- Сергей, привет. Как себя Ира чувствует?\n- Изображение неплохое, а вот звук неважный.","Объявление: 55-летняя женщина, мать троих программистов, просит кого-нибудь не психованного научить ее интернету.","- Чем отличается программист от политика?\n- Программисту платят деньги за работающие программы.","Российские программисты создали аналог известной программы \"Окей, Google!\" под названием \"Окей, Х*й!\", потому что в России последний знает намного больше, чем Google.","Жил-был программист и было у него два сына - Антон и Неантон.","К бухгалтерам пришёл программист чего то исправлять в программе. Спрашивает: \n- У вас моносеть? — нормальный вопрос системщика.\nБухгалтера, от души: \n— Можно, садись.","Сидит программист в столовой, обедает, суп ест. В очках такой, задумчивый, программу думает. Народу никого, все уже поели, ушли. Подходит к нему официантка и заигрывает:\n- Если Вы хотите хорошо провести время, то меня зовут Маша!\nПрограммист медленно возвращается на землю и смотрит на официантку отрешенным взглядом и на автопилоте спрашивает:\n- А если не хочу, то как Вас зовут?!","Тяжело быть программистом. Приходишь отдохнуть к людям в гости, а тебе сразу показывают домашний компьютер и просят разобраться с его проблемами. \n- Представляю каково проктологам."]